src/InformationRegisters/СкидкиШапки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>СкидкиШапки</Name>
			<Comment>Сведения о скидках назначаемых на документы в целом</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗначениеСкидки</Name>
					<Comment>Значение скидки</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Действует</Name>
					<Comment>Действует или нет</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособВычисления</Name>
					<Comment>Способ вычисления скидки (относительная/абсолютная)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СкидкиСпособВычисления</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФлагВытеснения</Name>
					<Comment>Флаг вытеснения</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидПрайсЛистаПодарка</Name>
					<Comment>Прайс-лист подарка</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыПрайсЛистов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МаксимальнаяСуммаПодарка</Name>
					<Comment>Максимальная сумма на которую можно сделать подарок</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МоментИзменения</Name>
					<Comment>Момент последнего изменения скидки. Если момент больше чем "момент последней загрузки" оборудования, то эту скидку надо выгрузить в оборудование</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторСкидки</Name>
					<Comment>Идентификатор скидки</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПодразделениеКомпании</Name>
					<Comment>Подразделение компании</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РучнаяСкидка</Name>
					<Comment>Истина, если скидка задается в ручную. Ложь, если скидка автоматическая</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НачВремя</Name>
					<Comment>Время начала действия скидки</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КонВремя</Name>
					<Comment>Время окончания действия скидки</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДниНедели</Name>
					<Comment>Дни недели, когда действительна скидка</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>7</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЭтоПодарок</Name>
					<Comment>Истина, если скидка является подарком. Ложь, в противном случае</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДисконтнаяКарта</Name>
					<Comment>Карта, на которую назначается скидка</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Карточки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОтСуммыНакопленияНаКарте</Name>
					<Comment>Сумма накопительная, применяется совместно с дисконтной картой</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗалОбслуживания</Name>
					<Comment>Зал/Склад/Отдел в котором действует данная скидка</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладыКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Свойство</Name>
					<Comment>Свойство документа, от которого зависеть скидка</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОтСуммыЧека</Name>
					<Comment>Сумма, начиная с которой скидка имеет действие</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Скидка</Name>
					<Comment>Скидка</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыСкидок</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СрокДействия</Name>
					<Comment>Срок действия цен</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторСкидкиВОборудовании</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/AccumulationRegisters/НакопленияПоКарточкамКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>НакопленияПоКарточкамКонтрагентов</Name>
			<Comment>Накопления по карточкам контрагентов</Comment>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Comment>Сумма в валюте регл. учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоЧеков</Name>
					<Comment>Количество чеков в документе</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоНоменклатуры</Name>
					<Comment>Количество номенклатуры в документе</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Comment>Хозяйственная операция</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Карточка</Name>
					<Comment>Карточка</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Карточки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПодразделениеКомпании</Name>
					<Comment>Подразделение компании</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>Контрагент</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/CommonModules/СкидкиНаценкиПовтИсп/Ext/Module.bsl
// процедура возвращает таблицу со скидками согласно текущему отбору
Функция ОбщиеСкидки(Дата, ПодразделениеКомпании, Карточка, Склад) Экспорт
	
	// создание запроса
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Дата"       , Дата);
	Запрос.УстановитьПараметр("Время"      , '00010101' + (Дата - НачалоДня(Дата)));
	Запрос.УстановитьПараметр("ДеньНедели" , ДеньНедели(Дата));
	
	Запрос.УстановитьПараметр("ПодразделенияКомпании" , СкидкиНаценкиСервер.ПолучитьИерархию(ПодразделениеКомпании));
	Запрос.УстановитьПараметр("Карточки"              , СкидкиНаценкиСервер.ПолучитьИерархию(Карточка, Истина));
	Запрос.УстановитьПараметр("Склады"                , СкидкиНаценкиСервер.ПолучитьИерархию(Склад, Истина));
	
	// Сформируем текст запроса
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СкидкиШапкиСрезПоследних.Скидка,
	|	СкидкиШапкиСрезПоследних.СпособВычисления,
	|	СкидкиШапкиСрезПоследних.Скидка.ВидСвойства КАК ВидСвойства,
	|	СкидкиШапкиСрезПоследних.Свойство,
	|	СкидкиШапкиСрезПоследних.ЗначениеСкидки,
	|	СкидкиШапкиСрезПоследних.ОтСуммыЧека,
	|	СкидкиШапкиСрезПоследних.ЭтоПодарок,
	|	СкидкиШапкиСрезПоследних.ВидПрайсЛистаПодарка,
	|	СкидкиШапкиСрезПоследних.МаксимальнаяСуммаПодарка,
	|	СкидкиШапкиСрезПоследних.ФлагВытеснения,
	|	СкидкиШапкиСрезПоследних.ОтСуммыНакопленияНаКарте,
	|	СкидкиШапкиСрезПоследних.РучнаяСкидка
	|ИЗ
	|	РегистрСведений.СкидкиШапки.СрезПоследних(
	|			&Дата,
	|			&Время МЕЖДУ НачВремя И КонВремя
	|				И ПОДСТРОКА(ДниНедели, &ДеньНедели, 1) = ""1""
	|				И ПодразделениеКомпании В (&ПодразделенияКомпании)
	|				И ДисконтнаяКарта В (&Карточки)
	|				И (Скидка.ИспользоватьДляФронтОфиса = ИСТИНА ИЛИ 
	|				Скидка.ИспользоватьДляБэкОфиса = ИСТИНА)
	|				И ЗалОбслуживания В (&Склады)) КАК СкидкиШапкиСрезПоследних
	|ГДЕ
	|	СкидкиШапкиСрезПоследних.Действует";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция СтрочныеСкидки(Дата, ПодразделениеКомпании, Карточка, Склад) Экспорт
	
	// создание запроса
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Дата"       , Дата);
	Запрос.УстановитьПараметр("Время"      , '00010101' + (Дата - НачалоДня(Дата)));
	Запрос.УстановитьПараметр("ДеньНедели" , ДеньНедели(Дата));
	
	Запрос.УстановитьПараметр("ПодразделенияКомпании" , СкидкиНаценкиСервер.ПолучитьИерархию(ПодразделениеКомпании));
	Запрос.УстановитьПараметр("Карточки"              , СкидкиНаценкиСервер.ПолучитьИерархию(Карточка, Истина));
	Запрос.УстановитьПараметр("Склады"                , СкидкиНаценкиСервер.ПолучитьИерархию(Склад, Истина));
	
	// Сформируем текст запроса
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СкидкиСтрокиСрезПоследних.РучнаяСкидка,
	|	СкидкиСтрокиСрезПоследних.Объект,
	|	СкидкиСтрокиСрезПоследних.Скидка,
	|	СкидкиСтрокиСрезПоследних.Скидка.ВидСвойства КАК ВидСвойства,
	|	СкидкиСтрокиСрезПоследних.Свойство,
	|	СкидкиСтрокиСрезПоследних.СпособВычисления,
	|	СкидкиСтрокиСрезПоследних.ЗначениеСкидки,
	|	СкидкиСтрокиСрезПоследних.ОтСуммыСтроки,
	|	СкидкиСтрокиСрезПоследних.ОтКоличества,
	|	СкидкиСтрокиСрезПоследних.Правило,
	|	СкидкиСтрокиСрезПоследних.ЭтоПодарок,
	|	СкидкиСтрокиСрезПоследних.ВидПрайсЛистаПодарка,
	|	СкидкиСтрокиСрезПоследних.МаксимальнаяСуммаПодарка,
	|	СкидкиСтрокиСрезПоследних.ФлагВытеснения,
	|	СкидкиСтрокиСрезПоследних.ОтСуммыНакопленияНаКарте
	|ИЗ
	|	РегистрСведений.СкидкиСтроки.СрезПоследних(
	|			&Дата,
	|			&Время МЕЖДУ НачВремя И КонВремя
	|				И ПОДСТРОКА(ДниНедели, &ДеньНедели, 1) = ""1""
	|				И ПодразделениеКомпании В (&ПодразделенияКомпании)
	|				И ДисконтнаяКарта В (&Карточки)
	|				И (Скидка.ИспользоватьДляФронтОфиса = ИСТИНА ИЛИ 
	|				Скидка.ИспользоватьДляБэкОфиса = ИСТИНА)
	|				И ЗалОбслуживания В (&Склады)) КАК СкидкиСтрокиСрезПоследних
	|ГДЕ
	|	СкидкиСтрокиСрезПоследних.Действует";
	
	
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

// Расчет суммы накопления на карте
//
// Параметры:
//  Карта         - СправочникСсылка.Карточки              - Дебиторская карта
//  Подразделение - СправочникСсылка.ПодразделенияКомпании - Подразделение для которого нужно получить накопления.
//
Функция СуммуНакопленияНаКарте(Карта, Подразделение) Экспорт
	Сумма = 0;
	
	Если ЗначениеЗаполнено(Карта) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СУММА(НакопленияПоКарточкамКонтрагентовОбороты.СуммаОборот) КАК Сумма
		|ИЗ
		|	РегистрНакопления.НакопленияПоКарточкамКонтрагентов.Обороты(
		|			,
		|			,
		|			,
		|			Карточка = &Карта
		|			И Контрагент = &Контрагент
		|			И ПодразделениеКомпании = &ПодразделениеКомпании) КАК НакопленияПоКарточкамКонтрагентовОбороты";
		
		Запрос.УстановитьПараметр("Карта"                , Карта);
		Запрос.УстановитьПараметр("Контрагент"           , Карта.Объект);
		Запрос.УстановитьПараметр("ПодразделениеКомпании", Подразделение);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если НЕ РезультатЗапроса.Пустой() Тогда
			Сумма = РезультатЗапроса.Выгрузить()[0].Сумма;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Сумма;
КонецФункции

Функция ВалютаРегламентированногоУчетаОрганизаций() Экспорт
	
	Возврат Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
	
КонецФункции

Функция ВалютаНакопительныхСумм() Экспорт
	
	Возврат Константы.ВалютаНакопительныхСумм.Получить();
	
КонецФункции
